WSDL/Producao/PVoltaRedondaRJ-SIMPLISS.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="NfseService" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:i0="http://nfse.abrasf.org.br" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://tempuri.org/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><wsp:Policy wsu:Id="BasicHttpBinding_INfseService_policy"><wsp:ExactlyOne><wsp:All><sp:TransportBinding xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy"><wsp:Policy><sp:TransportToken><wsp:Policy><sp:HttpsToken RequireClientCertificate="true"/></wsp:Policy></sp:TransportToken><sp:AlgorithmSuite><wsp:Policy><sp:Basic256/></wsp:Policy></sp:AlgorithmSuite><sp:Layout><wsp:Policy><sp:Strict/></wsp:Policy></sp:Layout></wsp:Policy></sp:TransportBinding></wsp:All></wsp:ExactlyOne></wsp:Policy><wsdl:import namespace="http://nfse.abrasf.org.br" location="https://wsvoltaredonda.simplissweb.com.br/nfseservice.svc?wsdl=wsdl0"/><wsdl:types/><wsdl:binding name="BasicHttpBinding_INfseService" type="i0:INfseService"><wsp:PolicyReference URI="#BasicHttpBinding_INfseService_policy"/><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="RecepcionarLoteRps"><soap:operation soapAction="http://nfse.abrasf.org.br/INfseService/RecepcionarLoteRps" style="document"/><wsdl:input name="RecepcionarLoteRpsRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="RecepcionarLoteRpsResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GerarNfse"><soap:operation soapAction="http://nfse.abrasf.org.br/INfseService/GerarNfse" style="document"/><wsdl:input name="GerarNfseRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="GerarNfseResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="CancelarNfse"><soap:operation soapAction="http://nfse.abrasf.org.br/INfseService/CancelarNfse" style="document"/><wsdl:input name="CancelarNfseRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="CancelarNfseResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="SubstituirNfse"><soap:operation soapAction="http://nfse.abrasf.org.br/INfseService/SubstituirNfse" style="document"/><wsdl:input name="SubstituirNfseRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="SubstituirNfseResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="ConsultarLoteRps"><soap:operation soapAction="http://nfse.abrasf.org.br/INfseService/ConsultarLoteRps" style="document"/><wsdl:input name="ConsultarLoteRpsRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="ConsultarLoteRpsResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="ConsultarNfseRps"><soap:operation soapAction="http://nfse.abrasf.org.br/INfseService/ConsultarNfseRps" style="document"/><wsdl:input name="ConsultarNfseRpsRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="ConsultarNfseRpsResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="ConsultarNfseServicoPrestado"><soap:operation soapAction="http://nfse.abrasf.org.br/INfseService/ConsultarNfseServicoPrestado" style="document"/><wsdl:input name="ConsultarNfseServicoPrestadoRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="ConsultarNfseServicoPrestadoResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="ConsultarNfseServicoTomado"><soap:operation soapAction="http://nfse.abrasf.org.br/INfseService/ConsultarNfseServicoTomado" style="document"/><wsdl:input name="ConsultarNfseServicoTomadoRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="ConsultarNfseServicoTomadoResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="ConsultarNfseFaixa"><soap:operation soapAction="http://nfse.abrasf.org.br/INfseService/ConsultarNfseFaixa" style="document"/><wsdl:input name="ConsultarNfseFaixaRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="ConsultarNfseFaixaResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="NfseService"><wsdl:port name="BasicHttpBinding_INfseService" binding="tns:BasicHttpBinding_INfseService"><soap:address location="https://wsvoltaredonda.simplissweb.com.br/nfseservice.svc"/></wsdl:port></wsdl:service></wsdl:definitions>